app/views/tags/show.html.erb

  <tbody>
    <% @tag.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."tag_id" = ?  [["tag_id", 1]]