app/views/tags/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."tag_id" = ?  [["tag_id", 1]]
---
<div class="content-cards">
    <% @tag.articles.each do |article| %>