app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "tag_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "e"], ["content", "e"], ["created_at", "2018-07-01 19:34:59.410317"], ["updated_at", "2018-07-01 19:34:59.410317"], ["tag_id", 1], ["user_id", 1]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "tag_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["tag_id", 1], ["updated_at", "2018-07-01 18:26:42.709277"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)

SELECT "tags".* FROM "tags"
---
    def set_tag
      @tags = Tag.all