app/controllers/home_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    @home = Article.all.order("id DESC").limit 6
    @tag = Tag.all