app/controllers/home_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY id DESC LIMIT ?  [["LIMIT", 11]]
---
  def index
    @home = Article.all.limit 6