app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tecnology"], ["created_at", "2018-07-01 13:14:39.362543"], ["updated_at", "2018-07-01 13:14:39.362543"]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save